Autodesk.Revit.DB.Structure.RebarRoundingManager.ApplicableSegmentLengthRoundingMethod
The applicable rounding method for shared parameters used by rebar.
Remarks:
IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true.
ApplicableSegmentLengthRoundingMethod is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
Since:
2016

Autodesk.Revit.DB.Structure.RebarRoundingManager.ApplicableTotalLengthRoundingMethod
The applicable rounding method for Bar Length and Total Bar Length parameters.
Remarks:
IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true.
ApplicableTotalLengthRoundingMethod is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
Since:
2016

Autodesk.Revit.DB.Structure.RebarRoundingManager.ApplicableSegmentLengthRounding
The applicable rounding for shared parameters used by rebar.
Remarks:
IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true.
ApplicableSegmentLengthRounding is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
Since:
2014

Autodesk.Revit.DB.Structure.RebarRoundingManager.ApplicableTotalLengthRounding
The applicable rounding for Bar Length and Total Bar Length parameters.
Remarks:
IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true.
ApplicableTotalLengthRounding is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
Since:
2014

Autodesk.Revit.DB.Structure.RebarRoundingManager.SegmentLengthRoundingMethod
Identifies the segment length rounding method
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: IsActiveOnElement property is false.
Since:
2016

Autodesk.Revit.DB.Structure.RebarRoundingManager.SegmentLengthRounding
The rounding for shared parameters used by rebar.
Remarks:
IsActiveOnElement property has to be true. SegmentLengthRounding is meaningless if IsActiveOnElement is false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for value is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The rounding value is not a positive value.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: IsActiveOnElement property is false.
Since:
2014

Autodesk.Revit.DB.Structure.RebarRoundingManager.TotalLengthRoundingMethod
Identifies the total length rounding method
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: IsActiveOnElement property is false.
Since:
2016

Autodesk.Revit.DB.Structure.RebarRoundingManager.TotalLengthRounding
The rounding for Bar Length and Total Bar Length parameters.
Remarks:
IsActiveOnElement property has to be true. TotalLengthRounding is meaningless if IsActiveOnElement is false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for value is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The rounding value is not a positive value.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: IsActiveOnElement property is false.
Since:
2014

Autodesk.Revit.DB.Structure.RebarRoundingManager.ApplicableReinforcementRoundingSource
Identifies the source of the rounding settings for this element.
Remarks:
For a Rebar or RebarInSystem element, this could be Rebar, RebarType, or ReinforcementSettings. For a RebarType, this could be RebarType or ReinforcementSettings.
Since:
2014

Autodesk.Revit.DB.Structure.RebarRoundingManager
Provides access to element reinforcement roundings overrides.
Remarks:
An instance of this class can be obtained from specific RebarTypes or individual Rebar or RebarInSystem elements to apply overrides different from the global settings for the project.
Since:
2014